Revit 2027 API
PushButtonData Methods
The PushButtonData type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from ItemData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetContextualHelp | Gets the contextual help bound with this control.
(Inherited from RibbonItemData)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetContextualHelp | Sets the contextual help bound with this button data.
(Inherited from RibbonItemData)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
PushButtonData Class
Autodesk.Revit.UI Namespace